Конфигурация/src/Documents/ПриказОПереводе/ПриказОПереводе.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПриказОПереводе</name>
  <registerRecords>InformationRegister.СоставУчебныхГрупп</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>УчебныйПериод</name>
    <type>
      <types>CatalogRef.УчебныеПериоды</types>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Студенты</name>
    <attributes>
      <name>Студент</name>
      <type>
        <types>CatalogRef.Студенты</types>
      </type>
    </attributes>
    <attributes>
      <name>СтараяГруппа</name>
      <type>
        <types>CatalogRef.УчебныеГруппы</types>
      </type>
    </attributes>
    <attributes>
      <name>НоваяГруппа</name>
      <type>
        <types>CatalogRef.УчебныеГруппы</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Конфигурация/src/InformationRegisters/СоставУчебныхГрупп/СоставУчебныхГрупп.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СоставУчебныхГрупп</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыСтудента</types>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Студент</name>
    <type>
      <types>CatalogRef.Студенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>УчебнаяГруппа</name>
    <type>
      <types>CatalogRef.УчебныеГруппы</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Конфигурация/src/Enums/СтатусыСтудента/СтатусыСтудента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыСтудента</name>
  <enumValues>
    <name>Обучается</name>
  </enumValues>
  <enumValues>
    <name>Отчислен</name>
  </enumValues>
  <enumValues>
    <name>Выпускник</name>
  </enumValues>
  <enumValues>
    <name>АкадемическийОтпуск</name>
  </enumValues>
</mdclass:Enum>

Конфигурация/src/Documents/ПриказОПереводе/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	Движения.СоставУчебныхГрупп.Записывать = Истина;

	Для Каждого СтрокаСтудента Из Студенты Цикл

		Если НЕ ЗначениеЗаполнено(СтрокаСтудента.Студент) Тогда
			Продолжить;
		КонецЕсли;

		Если НЕ ЗначениеЗаполнено(СтрокаСтудента.НоваяГруппа) Тогда
			Продолжить;
		КонецЕсли;

		Движение = Движения.СоставУчебныхГрупп.Добавить();
		Движение.Период = Дата;
		Движение.Студент = СтрокаСтудента.Студент;
		Движение.УчебнаяГруппа = СтрокаСтудента.НоваяГруппа;
		Движение.Статус = Перечисления.СтатусыСтудента.Обучается;
		Движение.Основание = Основание;

	КонецЦикла;

КонецПроцедуры
